In [121]:
import sqlite3

In [111]:
# 2 - Table stores the January and February total rainfall in inches
data = [
    
    ('New York City', 11, 12),
    ('Los Angeles', 10, 8),
    ('Washington DC', 13, 14),
    ('Richmond', 15, 18),
    ('Anapolis', 14, 16),
]

In [112]:
path_to_db = "C:/Users/oubra/anaconda3/Lib/site-packages/sqlalchemy/dialects/sqlite/mydata.db"
conn = sqlite3.connect(path_to_db)
cur = conn.cursor()

In [113]:
# 3
cur.execute('create table mytable (City, Jan rainfall, Feb rainfall)')
conn.commit()

In [116]:
# 4
cur.executemany('insert into mytable values (?,?,?)', data)
conn.commit()

In [117]:
# 5
for row in cur.execute('select * from mytable'):
    print(row)

('New York City', 11, 12)
('Los Angeles', 10, 8)
('Washington DC', 13, 14)
('Richmond', 15, 18)
('Anapolis', 14, 16)

In [118]:
# 6
for row in cur.execute('select * from mytable where Feb >= 16'):
    print(row)

('Richmond', 15, 18)
('Anapolis', 14, 16)

In [127]:
# 7

# Calculates total rainfall in January and February
for row in cur.execute('select City, (Jan + Feb) from mytable GROUP BY City'):
    print(row)

('Anapolis', 30)
('Los Angeles', 18)
('New York City', 23)
('Richmond', 33)
('Washington DC', 27)

In [128]:
# 8

# https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html#reading-tables
import pandas as pd

df = pd.read_sql_query("select City, Jan, Feb from mytable GROUP BY City", conn)
df.head(5)

            City  Jan  Feb
0       Anapolis   14   16
1    Los Angeles   10    8
2  New York City   11   12
3       Richmond   15   18
4  Washington DC   13   14